Конфигурация/Documents/АктПриемаПередачиОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>АктПриемаПередачиОбъектовНедвижимости</Name>
			<BasedOn>
				<xr:Item>Document.СделкаСНедвижимостью</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УсловияСделокСНедвижимостью</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаСНедвижимостью</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВключатьВСтоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыНедвижимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимостиПоДДУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ЗадолженностиПоДенежнымСредствам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностиПоДенежнымСредствам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ИФНСОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИФНСОрганизаций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИФНС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоКрупнейшимНалогоплательщикам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияСделокСНедвижимостью.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияСделокСНедвижимостью</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлановаяДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АктПриемаПередачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктПриемаПередачиОбъектовНедвижимости</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводПрочихАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СведенияОГосРегистрацииПраваСобственности</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СведенияОРегистрацииПраваСобственности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаСНедвижимостью</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/СчетФактура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СчетФактура</Name>
			<BasedOn>
				<xr:Item>Document.Оплата</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчетаФактуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетовФактур</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактурыПолученного</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Оплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/АктПриемаПередачиОбъектовНедвижимости/Ext/ObjectModule.bsl
Процедура УстановитьБлокировки(ВестиУчетНДС)
	
	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	Если ВестиУчетНДС  Тогда
	
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ЗадолженностиПоДенежнымСредствам");
		ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  ЭтотОбъект.Организация);
		ЭлементБлокировкиДанных.УстановитьЗначение("Контрагент",             	   РегистрыСведений.ИФНСОрганизаций.ПолучитьИФНС(ЭтотОбъект.Дата, ЭтотОбъект.Организация, Истина));
		ЭлементБлокировкиДанных.УстановитьЗначение("Аванс",       			       Ложь);
		ЭлементБлокировкиДанных.УстановитьЗначение("ВидЗадолженности",             Справочники.ВидыЗадолженности.НДСПоАвансам);
		ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		ЭлементБлокировкиДанных.УстановитьЗначение("Валюта",             	       ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"));
		
	КонецЕсли;
	
	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры // УстановитьБлокировки

Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт
	
	Движения[УчетныйРегистр].Записывать = Истина;
	
	// Получение списка проводок вынесено в модуль менеджера
	НаборПроводок = Документы.АктПриемаПередачиОбъектовНедвижимости.ПодготовитьНаборПроводок(
		ЭтотОбъект.Ссылка, 
		ЭтотОбъект.Дата, 
		ЭтотОбъект.Организация, 
		ЭтотОбъект.СчетДоверительногоУправления,
		УчетныйРегистр, 
		Отказ);
				
	Если Отказ ИЛИ НаборПроводок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТЗПроводок = НаборПроводок.Выгрузить();
	ТЗПроводок.ЗаполнитьЗначения(ЭтотОбъект.Ссылка, "Регистратор");
	Движения[УчетныйРегистр].Загрузить(ТЗПроводок);  
	
	Движения[УчетныйРегистр].Записать();

	#Область ПроверкаОтрицательныхОстатков
	
	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Основание, "ВидПраваНаНедвижимость, ВидСделки, Контрагент, Договор");
	Если РеквизитыОснования.ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Собственность Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АвансОстатки.Счет КАК Счет,
		|	АвансОстатки.Счет В (ЗНАЧЕНИЕ(ПланСчетов.Основной.НДСПоАвансамВыданным), ЗНАЧЕНИЕ(ПланСчетов.Основной.НДСПоАвансамПолученным)) КАК ЭтоНДСПоАвансам,
		|	АвансОстатки.Субконто2 КАК Основание,
		|	АвансОстатки.СуммаОстатокДт КАК СуммаОстатокДт,
		|	АвансОстатки.СуммаОстатокКт КАК СуммаОстатокКт,
		|	АвансОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = &Счет,
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Субконто1 = &Контрагент
		|				И Субконто2 В
		|					(ВЫБРАТЬ
		|						СчетФактура.Ссылка КАК Основание
		|					ИЗ
		|						Документ.СчетФактура КАК СчетФактура
		|					ГДЕ
		|						СчетФактура.Контрагент = &Контрагент
		|						И СчетФактура.Договор = &Договор
		|						И СчетФактура.Организация = &Организация
		|						И СчетФактура.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|						И СчетФактура.Дата <= &ПериодДата)) КАК АвансОстатки
		|ГДЕ
		|	ВЫБОР
		|			КОГДА АвансОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.НДСПоАвансамПолученным)
		|				ТОГДА АвансОстатки.СуммаОстатокДт < 0
		|			КОГДА АвансОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.НДСПоАвансамВыданным)
		|				ТОГДА АвансОстатки.СуммаОстатокКт < 0
		|		КОНЕЦ";
		
		Запрос.УстановитьПараметр("Счет", ?(РеквизитыОснования.ВидСделки = Перечисления.ВидыСделок.Покупка, ПланыСчетов.Основной.НДСПоАвансамВыданным, ПланыСчетов.Основной.НДСПоАвансамПолученным));
		Запрос.УстановитьПараметр("Контрагент", РеквизитыОснования.Контрагент);
		Запрос.УстановитьПараметр("Договор", 	РеквизитыОснования.Договор);
		Запрос.УстановитьПараметр("Организация", 					ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Период", 						Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ПериодДата", 					ЭтотОбъект.Дата);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ЭтотОбъект.СчетДоверительногоУправления));
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", УчетныйРегистр);

		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма зачитываемого аванса больше, чем в БЭКОФИСЕ. Документ " + ЭтотОбъект + " не проведен по виду учета " + УчетныйРегистр + "!", ЭтотОбъект,,,Отказ);
		КонецЕсли;
		
	КонецЕсли;
	#КонецОбласти
	
КонецПроцедуры

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	ВестиУчетНДС = РаботаСНДС.ВестиУчетНДС(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	УстановитьБлокировки(ВестиУчетНДС);
	
	Движения.УсловияСделокСНедвижимостью.Записывать = Истина;
	Движения.ЗадолженностиПоДенежнымСредствам.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	&Основание КАК Основание,
		|	УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	ЗНАЧЕНИЕ(Справочник.ОбъектыНедвижимости.ПустаяСсылка) КАК ОбъектНедвижимостиПоДДУ,
		|	ЛОЖЬ КАК НетУсловий,
		|	0 КАК Сумма,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка) КАК СтавкаНДС,
		|	0 КАК СуммаНДС,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ПлановаяДатаПередачи,
		|	ИСТИНА КАК Отменено,
		|	ЗНАЧЕНИЕ(Документ.АктПриемаПередачиОбъектовНедвижимости.) КАК АктПриемаПередачи,
		|	ЗНАЧЕНИЕ(Документ.СведенияОРегистрацииПраваСобственности.) КАК СведенияОГосРегистрацииПраваСобственности
		|ИЗ
		|	РегистрСведений.УсловияСделокСНедвижимостью.СрезПоследних(
		|			&Момент,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Основание = &Основание) КАК УсловияСделокСНедвижимостьюСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АктПриемаПередачиОбъектовНедвижимости.ОбъектыНедвижимости КАК АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости
		|		ПО (АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости.Ссылка = &Ссылка)
		|			И УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости = АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости.ОбъектНедвижимостиПоДДУ
		|			И УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости <> АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости.ОбъектНедвижимости
		|ГДЕ
		|	УсловияСделокСНедвижимостьюСрезПоследних.Отменено = ЛОЖЬ
		|	И НЕ АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости.Ссылка ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период КАК Период,
		|	&Организация КАК Организация,
		|	&СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	&Основание КАК Основание,
		|	АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости.ОбъектНедвижимости,
		|	ВЫБОР
		|		КОГДА АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости.ОбъектНедвижимостиПоДДУ = ЗНАЧЕНИЕ(Справочник.ОбъектыНедвижимости.)
		|			ТОГДА АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости.ОбъектНедвижимости
		|		ИНАЧЕ АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости.ОбъектНедвижимостиПоДДУ
		|	КОНЕЦ,
		|	УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости ЕСТЬ NULL,
		|	ЕСТЬNULL(УсловияСделокСНедвижимостьюСрезПоследних.Сумма, 0),
		|	ЕСТЬNULL(УсловияСделокСНедвижимостьюСрезПоследних.СтавкаНДС, ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)),
		|	ЕСТЬNULL(УсловияСделокСНедвижимостьюСрезПоследних.СуммаНДС, 0),
		|	ЕСТЬNULL(УсловияСделокСНедвижимостьюСрезПоследних.ПлановаяДатаПередачи, ДАТАВРЕМЯ(1, 1, 1)),
		|	ЕСТЬNULL(УсловияСделокСНедвижимостьюСрезПоследних.Отменено, ЛОЖЬ),
		|	&Ссылка,
		|	ЕСТЬNULL(УсловияСделокСНедвижимостьюСрезПоследних.СведенияОГосРегистрацииПраваСобственности, ЗНАЧЕНИЕ(Документ.СведенияОРегистрацииПраваСобственности.))
		|ИЗ
		|	Документ.АктПриемаПередачиОбъектовНедвижимости.ОбъектыНедвижимости КАК АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияСделокСНедвижимостью.СрезПоследних(
		|				&Момент,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И Основание = &Основание) КАК УсловияСделокСНедвижимостьюСрезПоследних
		|		ПО (УсловияСделокСНедвижимостьюСрезПоследних.Отменено = ЛОЖЬ)
		|			И (ВЫБОР
		|				КОГДА АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости.ОбъектНедвижимостиПоДДУ = ЗНАЧЕНИЕ(Справочник.ОбъектыНедвижимости.)
		|					ТОГДА АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости.ОбъектНедвижимости
		|				ИНАЧЕ АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости.ОбъектНедвижимостиПоДДУ
		|			КОНЕЦ = УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости)
		|ГДЕ
		|	АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Момент", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Основание", ЭтотОбъект.Основание);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	
	ОшибочныеСтроки = ТаблицаДвижений.НайтиСтроки(Новый Структура("НетУсловий", Истина));
	Если ОшибочныеСтроки.Количество() > 0 Тогда
		Для Каждого Строка Из ОшибочныеСтроки Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По основанию " + Строка.Основание + " нет объекта недвижимости " + Строка.ОбъектНедвижимостиПоДДУ + "!", ЭтотОбъект,,,Отказ);
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	Движения.УсловияСделокСНедвижимостью.Загрузить(ТаблицаДвижений);
	
	Документы.АктПриемаПередачиОбъектовНедвижимости.ОтразитьНДСНаРегистрахБэкОФиса(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СделкаСНедвижимостью") Тогда
		
		ЭтотОбъект.Дата = ТекущаяДата();
		ЭтотОбъект.СчетДоверительногоУправления = ДанныеЗаполнения.СчетДоверительногоУправления; 
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Основание) Тогда
			ЭтотОбъект.Основание = ДанныеЗаполнения.Основание;
		Иначе
			ЭтотОбъект.Основание = ДанныеЗаполнения;
		КонецЕсли;
		ЭтотОбъект.ВидЗадолженности =  Перечисления.ВидыПравНаНедвижимость.ОпределитьВидЗадолженности(ДанныеЗаполнения.ВидПраваНаНедвижимость);
		
		Если ЭтотОбъект.Основание.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
			ЭтотОбъект.ВидДвижения = Перечисления.ВидыДвижений.Приход;
		Иначе
			ЭтотОбъект.ВидДвижения = Перечисления.ВидыДвижений.Расход;
		КонецЕсли;
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	УсловияСделокСНедвижимостьюСрезПоследних.ОбъектНедвижимости КАК ОбъектНедвижимости,
			|	УсловияСделокСНедвижимостьюСрезПоследних.ПлановаяДатаПередачи КАК ПлановаяДатаПередачи
			|ИЗ
			|	РегистрСведений.УсловияСделокСНедвижимостью.СрезПоследних(
			|			&ТекущаяДата,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И Основание = &Основание) КАК УсловияСделокСНедвижимостьюСрезПоследних
			|ГДЕ
			|	НЕ УсловияСделокСНедвижимостьюСрезПоследних.Отменено
			|	И УсловияСделокСНедвижимостьюСрезПоследних.АктПриемаПередачи = ЗНАЧЕНИЕ(Документ.АктПриемаПередачиОбъектовНедвижимости.)";
		
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Основание", ЭтотОбъект.Основание);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("ТекущаяДата", ЭтотОбъект.Дата);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Строка = ЭтотОбъект.ОбъектыНедвижимости.Добавить();
			Строка.ОбъектНедвижимости  = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
			Если ЭтотОбъект.ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоДДУ") Тогда
				Строка.ОбъектНедвижимостиПоДДУ  = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	

	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);

	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, 
		"НомерСчетаФактуры, ДатаСчетаФактуры");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
			
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда

	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПриЗаписи

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти
